In [1]:
# Import libraries

In [2]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [3]:
# Set path

In [4]:
path = r'C:\Users\Andrew\Desktop\Data Immersion 1\Instacart Basket Analysis'

In [5]:
# Import data

In [6]:
customers = pd.read_csv(os.path.join(path, '02 data', 'original data', 'customers.csv'), index_col = False)

In [7]:
ords_prods_merged = pd.read_pickle(os.path.join(path, '02 data', 'prepared data', 'orders_products_merged.pkl'))

In [8]:
# Check data titles/columns

In [9]:
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [10]:
# Rename columns

In [11]:
customers.rename(columns={'STATE': 'State', 'n_dependants': 'Dependants', 'fam_status' : 'Marital status'}, inplace=True)

In [12]:
customers.head()

,user_id,First Name,Surnam,Gender,State,Age,date_joined,Dependants,Marital status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [13]:
# Drop unecessary columns

In [14]:
customer = customers.drop(columns = [ 'First Name', 'Surnam'])

In [15]:
customer.head()

,user_id,Gender,State,Age,date_joined,Dependants,Marital status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

In [16]:
# Check for null values

In [17]:
customer.isnull().sum()

user_id           0
Gender            0
State             0
Age               0
date_joined       0
Dependants        0
Marital status    0
income            0
dtype: int64

In [18]:
# Check for duplicates

In [19]:
duplicates = customer[customer.duplicated()]

In [20]:
duplicates.sum()

user_id           0.0
Gender            0.0
State             0.0
Age               0.0
date_joined       0.0
Dependants        0.0
Marital status    0.0
income            0.0
dtype: float64

In [21]:
# Check for mixed data

In [22]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 8 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  int64
 1   Gender          206209 non-null  object
 2   State           206209 non-null  object
 3   Age             206209 non-null  int64
 4   date_joined     206209 non-null  object
 5   Dependants      206209 non-null  int64
 6   Marital status  206209 non-null  object
 7   income          206209 non-null  int64
dtypes: int64(4), object(4)
memory usage: 12.6+ MB

In [23]:
for col in customer.columns.tolist():
  weird = (customer[[col]].applymap(type) != customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customer[weird]) > 0:
    print (col)

In [24]:
weird.value_counts()

False    206209
dtype: int64

In [26]:
Complete_data = customer.merge(ords_prods_merged, on = 'user_id', indicator = True)

In [29]:
complete_data = Complete_data.drop(columns = ['_merge'])

In [30]:
complete_data.head()

,user_id,Gender,State,Age,date_joined,Dependants,Marital status,income,order_id,order_number,...,aisle_id,department_id,prices,price_range_loc,busiest_day,busiest_period_of_day,max_order,loyalty_flag,spending,frequency
0,26711,Female,Missouri,48,1/1/2017,3,married,165665,2543867,5,...,77,7,9.0,Mid-range product,Busiest day,Average orders,8,New customer,Low spender,regular customer
1,26711,Female,Missouri,48,1/1/2017,3,married,165665,1285508,7,...,77,7,9.0,Mid-range product,Regularly busy,Average orders,8,New customer,Low spender,regular customer
2,26711,Female,Missouri,48,1/1/2017,3,married,165665,2578584,8,...,77,7,9.0,Mid-range product,Busiest day,Average orders,8,New customer,Low spender,regular customer
3,26711,Female,Missouri,48,1/1/2017,3,married,165665,423547,2,...,120,16,12.6,Mid-range product,Regularly busy,Average orders,8,New customer,Low spender,regular customer
4,26711,Female,Missouri,48,1/1/2017,3,married,165665,2524893,3,...,120,16,12.6,Mid-range product,Least busy,Average orders,8,New customer,Low spender,regular customer

In [31]:
complete_data.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'complete_data.pkl'))